{
  "metadata_schema_version": "1.1",
  "style": {
    "voice": "concise-incisive",
    "global_principles": [
      "Prioritise economy of language while keeping mathematical precision.",
      "Lead with pedagogical motivation before formal statements.",
      "Use consistent L/B/R and ledger terminology to reinforce cross-domain coherence.",
      "Highlight invariants and morphisms explicitly when transitioning between domains.",
      "Assume familiarity with mainstream QFT, string theory, and AGT; reference rather than re-teach standard constructions.",
      "Keep non-storyline exposition atomic—state the result, cite the source, move on.",
      "Maintain academic honesty: articulate assumptions and limitations when presenting conjectures or heuristics."
    ],
    "tone": {
      "keywords": [
        "concise",
        "incisive",
        "economical",
        "mathematically elegant",
        "pedagogical"
      ],
      "description": "Write with a clear instructional voice that guides the reader through progressively deeper abstractions without superfluous prose, while respecting a peer audience in high-energy theory."
    },
    "structural_habits": [
      "Open each section with a domain hand-off reminding the reader what is being imported.",
      "Frame definitions and theorems with short narrative bridges explaining purpose and ledger impact.",
      "Keep examples brisk and emblematic; avoid exhaustive case listings unless they surface a new invariant.",
      "Reserve rhetorical emphasis (e.g., italics, footnotes) for signposting cross-domain reuse.",
      "Flag conjectural or heuristic arguments explicitly and provide canonical references."
    ],
    "section_specific_notes": [
      {
        "target": "S01",
        "focus": "Invite the reader with minimal jargon while foreshadowing ledger terminology."
      },
      {
        "target": "S05",
        "focus": "State formal grammar succinctly, prefacing each block with a one-sentence pedagogical cue."
      },
      {
        "target": "S10",
        "focus": "Maintain theoretical diction even when introducing empirical terminology; emphasise mappings over anecdotes."
      },
      {
        "target": "S12",
        "focus": "Balance conjectural language with precise spectral definitions to retain mathematical elegance."
      }
    ],
    "thread_alignment": [
      {
        "thread_id": "computational_unification",
        "style_cue": "Use crisp comparative sentences to align the three computation paradigms before presenting equations."
      },
      {
        "thread_id": "logic_foundations",
        "style_cue": "Adopt formal-yet-teaching tone: definition, intuition, immediate consequence."
      },
      {
        "thread_id": "boundary_morphisms",
        "style_cue": "Signal domain transitions with ledger verbs (import/export) and keep exposition diagrammatic."
      },
      {
        "thread_id": "number_theory_application",
        "style_cue": "Anchor speculative claims with explicit operator identities to preserve reader confidence."
      },
      {
        "thread_id": "implementation_support",
        "style_cue": "Write in imperative-but-compact sentences so engineers can treat the appendix as a checklist."
      }
    ],
    "audience": {
      "primary_disciplines": [
        "hep-th",
        "math-ph"
      ],
      "assumed_familiarity": [
        "relativistic_quantum_field_theory",
        "string_theory_basics",
        "agt_correspondence"
      ],
      "notes": "Write as peers in high-energy theory; do not re-derive standard results unless they anchor a storyline."
    },
    "style_name": "hep-th-math-ph-peer"
  }
}